package src.home_work.LEC14_interfaces;

/*  Створити клас людина і двох потомків. Водій та пілот. Створити інтерфейс для описання процесу водіння.
 Зробити так, щоб цей клас імплементував цей інтерфейс
Створити інтерфейс який описує вміння літати і імплементувати його
У головному класі викликати методи літати та водити авто за допомогою інтерфейсів і поліморфізму
Тут пишу більш може конкретно.
1 абстрактний клас - людина, 2 потомки (2 чілда цього класу) - водій і пілот
2 інтерфейси один для водіння, один для літання.
в чалдах - в тому що пілот (вивести тільки що літаю), в тому що водій ( я вожу), нижче схемка :*/

public abstract class Human {
}
